wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_dma.h
/* DMAMUX request generator trigger polarity */                                                                        
#define RG_CHXCFG_RGTP(regval)            (BITS(17,18) & ((uint32_t)(regval) << 17U))                                  /*!< DMA request generator trigger polarity */
#define DMAMUX_GEN_NO_EVENT               RG_CHXCFG_RGTP(0U)                                                           /*!< no event detection */
#define DMAMUX_GEN_RISING                 RG_CHXCFG_RGTP(1U)                                                           /*!< rising edge */
#define DMAMUX_GEN_FALLING                RG_CHXCFG_RGTP(2U)                                                           /*!< falling edge */
#define DMAMUX_GEN_RISING_FALLING         RG_CHXCFG_RGTP(3U)                                                           /*!< rising and falling edges */
                                                                                                                       
/* number of DMA requests to be generated */                                                                           
#define RG_CHXCFG_NBRG(regval)            (BITS(19,23) & ((uint32_t)(regval) << 19U))                                  /*!< number of DMA requests to be generated */
                                                                                                                       
/* DMAMUX request multiplexer channel synchronization input identification */                                          
#define RM_CHXCFG_SYNCID(regval)          (BITS(24,29) & ((uint32_t)(regval) << 24U))                                  /*!< synchronization input identification */
#define DMAMUX_SYNC_EVT0_OUT              RM_CHXCFG_SYNCID(0U)                                                         /*!< synchronization input is Evt0_out */
#define DMAMUX_SYNC_EVT1_OUT              RM_CHXCFG_SYNCID(1U)                                                         /*!< synchronization input is Evt1_out */
#define DMAMUX_SYNC_EVT2_OUT              RM_CHXCFG_SYNCID(2U)                                                         /*!< synchronization input is Evt2_out */
#define DMAMUX_SYNC_EVT3_OUT              RM_CHXCFG_SYNCID(3U)                                                         /*!< synchronization input is Evt3_out */
#define DMAMUX_SYNC_EVT4_OUT              RM_CHXCFG_SYNCID(4U)                                                         /*!< synchronization input is Evt4_out */
#define DMAMUX_SYNC_EVT5_OUT              RM_CHXCFG_SYNCID(5U)                                                         /*!< synchronization input is Evt5_out */
#define DMAMUX_SYNC_EVT6_OUT              RM_CHXCFG_SYNCID(6U)                                                         /*!< synchronization input is Evt6_out */
#define DMAMUX_SYNC_EXTI0                 RM_CHXCFG_SYNCID(7U)                                                         /*!< synchronization input is EXTI_0 */
#define DMAMUX_SYNC_EXTI1                 RM_CHXCFG_SYNCID(8U)                                                         /*!< synchronization input is EXTI_1 */
#define DMAMUX_SYNC_EXTI2                 RM_CHXCFG_SYNCID(9U)                                                         /*!< synchronization input is EXTI_2 */
#define DMAMUX_SYNC_EXTI3                 RM_CHXCFG_SYNCID(10U)                                                        /*!< synchronization input is EXTI_3 */
#define DMAMUX_SYNC_EXTI4                 RM_CHXCFG_SYNCID(11U)                                                        /*!< synchronization input is EXTI_4 */
#define DMAMUX_SYNC_EXTI5                 RM_CHXCFG_SYNCID(12U)                                                        /*!< synchronization input is EXTI_5 */
#define DMAMUX_SYNC_EXTI6                 RM_CHXCFG_SYNCID(13U)                                                        /*!< synchronization input is EXTI_6 */
#define DMAMUX_SYNC_EXTI7                 RM_CHXCFG_SYNCID(14U)                                                        /*!< synchronization input is EXTI_7 */
#define DMAMUX_SYNC_EXTI8                 RM_CHXCFG_SYNCID(15U)                                                        /*!< synchronization input is EXTI_8 */
#define DMAMUX_SYNC_EXTI9                 RM_CHXCFG_SYNCID(16U)                                                        /*!< synchronization input is EXTI_9 */
#define DMAMUX_SYNC_EXTI10                RM_CHXCFG_SYNCID(17U)                                                        /*!< synchronization input is EXTI_10 */
#define DMAMUX_SYNC_EXTI11                RM_CHXCFG_SYNCID(18U)                                                        /*!< synchronization input is EXTI_11 */
#define DMAMUX_SYNC_EXTI12                RM_CHXCFG_SYNCID(19U)                                                        /*!< synchronization input is EXTI_12 */
#define DMAMUX_SYNC_EXTI13                RM_CHXCFG_SYNCID(20U)                                                        /*!< synchronization input is EXTI_13 */
#define DMAMUX_SYNC_EXTI14                RM_CHXCFG_SYNCID(21U)                                                        /*!< synchronization input is EXTI_14 */
#define DMAMUX_SYNC_EXTI15                RM_CHXCFG_SYNCID(22U)                                                        /*!< synchronization input is EXTI_15 */
#define DMAMUX_SYNC_RTC_WAKEUP            RM_CHXCFG_SYNCID(23U)                                                        /*!< synchronization input is RTC_WAKEUP */
#define DMAMUX_SYNC_CMP0_OUTPUT           RM_CHXCFG_SYNCID(24U)                                                        /*!< synchronization input is CMP0_OUTPUT */
#define DMAMUX_SYNC_I2C0_WAKEUP           RM_CHXCFG_SYNCID(25U)                                                        /*!< synchronization input is I2C0_WAKEUP */
#define DMAMUX_SYNC_I2C1_WAKEUP           RM_CHXCFG_SYNCID(26U)                                                        /*!< synchronization input is I2C1_WAKEUP */
#define DMAMUX_SYNC_I2C2_WAKEUP           RM_CHXCFG_SYNCID(27U)                                                        /*!< synchronization input is I2C2_WAKEUP */
#define DMAMUX_SYNC_I2C3_WAKEUP           RM_CHXCFG_SYNCID(28U)                                                        /*!< synchronization input is I2C3_WAKEUP */
#define DMAMUX_SYNC_EXTI0_EVENT           RM_CHXCFG_SYNCID(29U)                                                        /*!< synchronization input is EXTI_0_EVENT */
#define DMAMUX_SYNC_EXTI1_EVENT           RM_CHXCFG_SYNCID(30U)                                                        /*!< synchronization input is EXTI_1_EVENT */
#define DMAMUX_SYNC_EXTI2_EVENT           RM_CHXCFG_SYNCID(31U)                                                        /*!< synchronization input is EXTI_2_EVENT */
#define DMAMUX_SYNC_EXTI3_EVENT           RM_CHXCFG_SYNCID(32U)                                                        /*!< synchronization input is EXTI_3_EVENT */
#define DMAMUX_SYNC_EXTI4_EVENT           RM_CHXCFG_SYNCID(33U)                                                        /*!< synchronization input is EXTI_4_EVENT */
#define DMAMUX_SYNC_EXTI5_EVENT           RM_CHXCFG_SYNCID(34U)                                                        /*!< synchronization input is EXTI_5_EVENT */
#define DMAMUX_SYNC_EXTI6_EVENT           RM_CHXCFG_SYNCID(35U)                                                        /*!< synchronization input is EXTI_6_EVENT */
#define DMAMUX_SYNC_EXTI7_EVENT           RM_CHXCFG_SYNCID(36U)                                                        /*!< synchronization input is EXTI_7_EVENT */
#define DMAMUX_SYNC_EXTI8_EVENT           RM_CHXCFG_SYNCID(37U)                                                        /*!< synchronization input is EXTI_8_EVENT */
#define DMAMUX_SYNC_EXTI9_EVENT           RM_CHXCFG_SYNCID(38U)                                                        /*!< synchronization input is EXTI_9_EVENT */
#define DMAMUX_SYNC_EXTI10_EVENT          RM_CHXCFG_SYNCID(39U)                                                        /*!< synchronization input is EXTI_10_EVENT */
#define DMAMUX_SYNC_EXTI11_EVENT          RM_CHXCFG_SYNCID(40U)                                                        /*!< synchronization input is EXTI_11_EVENT */
#define DMAMUX_SYNC_EXTI12_EVENT          RM_CHXCFG_SYNCID(41U)                                                        /*!< synchronization input is EXTI_12_EVENT */
#define DMAMUX_SYNC_EXTI13_EVENT          RM_CHXCFG_SYNCID(42U)                                                        /*!< synchronization input is EXTI_13_EVENT */
#define DMAMUX_SYNC_EXTI14_EVENT          RM_CHXCFG_SYNCID(43U)                                                        /*!< synchronization input is EXTI_14_EVENT */
#define DMAMUX_SYNC_EXTI15_EVENT          RM_CHXCFG_SYNCID(44U)                                                        /*!< synchronization input is EXTI_15_EVENT */
#define DMAMUX_SYNC_EXTI19_EVENT          RM_CHXCFG_SYNCID(45U)                                                        /*!< synchronization input is EXTI_19_EVENT */
#define DMAMUX_SYNC_EXTI20_EVENT          RM_CHXCFG_SYNCID(46U)                                                        /*!< synchronization input is EXTI_20_EVENT */
#define DMAMUX_SYNC_EXTI33_EVENT          RM_CHXCFG_SYNCID(47U)                                                        /*!< synchronization input is EXTI_33_EVENT */
#define DMAMUX_SYNC_EXTI34_EVENT          RM_CHXCFG_SYNCID(48U)                                                        /*!< synchronization input is EXTI_34_EVENT */
#define DMAMUX_SYNC_EXTI35_EVENT          RM_CHXCFG_SYNCID(49U)                                                        /*!< synchronization input is EXTI_35_EVENT */
#define DMAMUX_SYNC_EXTI36_EVENT          RM_CHXCFG_SYNCID(50U)                                                        /*!< synchronization input is EXTI_36_EVENT */

